let board = ["", "", "", "", "", "", "", "", ""]
let 선공 = "x"
//공수 정하기 방법
if (board[0] == ""){
    board[0] = 선공
}
if(선공 == "x"){
    선공 = "o"
}
else{
    선공 = "x"
}
//보드(인덱스 0~8로 설계)
[0 | 1 | 2 |
 3 | 4 | 5 |
 6 | 7 | 8]

//이기는 경우(가로, 세로, 대각선 경우의 수)
// 가로
if (
   (board[0] === "선공" && board[1] === "선공" && board[2] === "선공") ||
   (board[3] === "선공" && board[4] === "선공" && board[5] === "선공") ||
   (board[6] === "선공" && board[7] === "선공" && board[8] === "선공") ||
//세로
   (board[0] === "선공" && board[3] === "선공" && board[6] === "선공") ||
   (board[1] === "선공" && board[4] === "선공" && board[7] === "선공") ||
   (board[2] === "선공" && board[5] === "선공" && board[8] === "선공") ||
//대각선
   (board[0] === "선공" && board[4] === "선공" && board[8] === "선공") ||
   (board[2] === "선공" && board[4] === "선공" && board[6] === "선공") 
)
{console.log('승리입니다.');}
//무승부(모든 칸이 다 채워져 있을 때)
else if(
   (board[0] !== "" && board[1] !== "" && board[2] !== "") &&
   (board[3] !== "" && board[4] !== "" && board[5] !== "") &&
   (board[6] !== "" && board[7] !== "" && board[8] !== "")
)
{console.log('무승부입니다.');}
else{console.log('게임 종료');}